{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "XLMRobertaModel",
    "parent_library": "transformers.models.xlm_roberta.modeling_xlm_roberta"
  },
  "base_model_name_or_path": "xlm-roberta-base",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "o_dense",
    "q_proj",
    "o_proj",
    "v_proj",
    "dense",
    "value",
    "key",
    "query",
    "k_proj"
  ],
  "target_parameters": null,
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}